src/Documents/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Зарплата</name>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <attributes>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Фирма</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудники</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НачисляемаяЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/НачислениеЗП/НачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеЗП</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Фирма</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Зарплата/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр НачислениеЗП
	Движения.НачислениеЗП.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники из Сотрудники Цикл
		Движение = Движения.НачислениеЗП.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Салон = Салон;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудники;
		Движение.Месяц = Месяц;
		Движение.Сумма = ТекСтрокаСотрудники.НачисляемаяЗП;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
